## Question 1: **Answer**

In [1]:
import sqlite3

In [ ]:
def add_data_to_database():
    try:
        # Connect to the SQLite database
        with sqlite3.connect('students_data.db') as conn:
            cursor = conn.cursor()

            # Create the table
            cursor.execute('''
            CREATE TABLE IF NOT EXISTS students (
                id INTEGER PRIMARY KEY,
                name TEXT,
                graduation_year INTEGER,
                grade TEXT
            )
            ''')
            # Insert data into the table
            cursor.executemany('''
            INSERT INTO students (id, name, graduation_year, grade) VALUES (?, ?, ?, ?)
            ''', [
                (1, 'Mpho', 2022, 'A'),
                (2, 'John', 2023, 'B'),
                (3, 'Charlie', 2022, 'A'),
                (4, 'David', 2021, 'C'),
                (5, 'Bob', 2023, 'A'),
                (6, 'Beatrice', 2022, 'B')
            ])
            conn.commit()
            print("Table created successfully.")
    except Exception as e:
        print(f"Error: {e}")

# Calling the function
add_data_to_database()

Table created successfully.

In [3]:
# Loading the extension
%load_ext sql

In [4]:
%sql sqlite:///students_data.db

In [5]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [6]:
%%sql
SELECT * FROM students;

 * sqlite:///students_data.db
Done.

[(1, 'Mpho', 2022, 'A'),
 (2, 'John', 2023, 'B'),
 (3, 'Charlie', 2022, 'A'),
 (4, 'David', 2021, 'C'),
 (5, 'Bob', 2023, 'A'),
 (6, 'Beatrice', 2022, 'B')]

## Question 2: **Answer**

In [7]:
%%sql
SELECT
    name,
    graduation_year
FROM students
WHERE graduation_year IN (2022, 2023)
ORDER BY graduation_year DESC;

 * sqlite:///students_data.db
Done.

[('John', 2023),
 ('Bob', 2023),
 ('Mpho', 2022),
 ('Charlie', 2022),
 ('Beatrice', 2022)]

## Question 3: **Answer**

In [8]:
%%sql
SELECT
    DISTINCT graduation_year
FROM students
ORDER BY graduation_year ASC;

 * sqlite:///students_data.db
Done.

[(2021,), (2022,), (2023,)]

## Question 4: **Answer**

In [9]:
%%sql
SELECT
    name,
    graduation_year,
    grade
FROM students
WHERE graduation_year IN (2022, 2023) AND grade = 'A';

 * sqlite:///students_data.db
Done.

[('Mpho', 2022, 'A'), ('Charlie', 2022, 'A'), ('Bob', 2023, 'A')]

## Question 5: **Answer**

In [10]:
%%sql
SELECT
    name,
    graduation_year,
    grade
FROM students
WHERE name LIKE 'B%'
ORDER BY name ASC;

 * sqlite:///students_data.db
Done.

[('Beatrice', 2022, 'B'), ('Bob', 2023, 'A')]

## Question 6: **Answer**

In [11]:
%%sql
SELECT 'apple' AS word UNION ALL SELECT 'Banana'
ORDER BY word ASC;

 * sqlite:///students_data.db
Done.

[('Banana',), ('apple',)]

In [12]:
%%sql
SELECT 'apple' AS word UNION ALL SELECT 'banana'
ORDER BY word ASC;

 * sqlite:///students_data.db
Done.

[('apple',), ('banana',)]

In [13]:
%%sql
SELECT 'apple' AS word UNION ALL SELECT 'Banana'
ORDER BY word COLLATE NOCASE ASC;

 * sqlite:///students_data.db
Done.

[('apple',), ('Banana',)]